In [18]:
import pandas as pd

house = pd.read_csv('house.csv')
house.drop(2, inplace=True)
house.head()

,id,date,price,bedrooms,bathrooms,floors,waterfront,view,condition,grade,yr_built
0,7129300520,20141013T000000,221900.0,3,1.00,1.0,0,0,3,7,1955
1,6414100192,20141209T000000,538000.0,3,2.25,2.0,0,0,3,7,1951
3,2487200875,20141209T000000,604000.0,4,3.00,1.0,0,0,5,7,1965
4,1954400510,20150218T000000,510000.0,3,2.00,1.0,0,0,3,8,1987
5,7237550310,20140512T000000,1230000.0,4,4.50,1.0,0,0,3,11,2001

#### Exercise1 house 데이터에서 세번째 행을 추출하세요. (loc과 iloc 모두 사용하기)

In [12]:
## code here

house.loc[3,:]
house.iloc[2,:]

id                 2487200875
date          20141209T000000
price                  604000
bedrooms                    4
bathrooms                   3
floors                      1
waterfront                  0
view                        0
condition                   5
grade                       7
yr_built                 1965
Name: 3, dtype: object

#### Exercise2 house 데이터에서 2~10번째 행, 8~10번째 열 (view~grade)을 추출하세요. (문제는 1을 시작으로 한 것, loc과 iloc 모두 사용하기)

In [16]:
## code here

house.iloc[2:11,8:11]
house.loc[2:10,'condition':'yr_built']

    condition  grade  yr_built
3           5      7      1965
4           3      8      1987
5           3     11      2001
6           3      7      1995
7           3      7      1963
8           3      7      1960
9           3      7      2003
10          3      8      1965

#### Exercise3 house 데이터에서 마지막 행을 추출하세요. (loc과 iloc 모두 사용하기)

In [52]:
## code here

house.iloc[-0,:]
house.loc[21612,:]

id                 1523300157
date          20141015T000000
price                  325000
bedrooms                    2
bathrooms                0.75
floors                      2
waterfront                  0
view                        0
condition                   3
grade                       7
yr_built                 2008
Name: 21612, dtype: object

In [51]:
house.tail()

,id,date,price,bedrooms,bathrooms,floors,waterfront,view,condition,grade,yr_built
21608,263000018,20140521T000000,360000.0,3,2.50,3.0,0,0,3,8,2009
21609,6600060120,20150223T000000,400000.0,4,2.50,2.0,0,0,3,8,2014
21610,1523300141,20140623T000000,402101.0,2,0.75,2.0,0,0,3,7,2009
21611,291310100,20150116T000000,400000.0,3,2.50,2.0,0,0,3,8,2004
21612,1523300157,20141015T000000,325000.0,2,0.75,2.0,0,0,3,7,2008

#### Exercise4 house 데이터에서 2010년 이후에 지어졌으며 침실 수가 평균 이상일 때 집값의 평균을 구하세요.

In [38]:
## code here
import numpy as np

house.loc[(house['yr_built']>2010)&(house['bedrooms']>=house['bedrooms'].mean()),'price'].mean()

742855.5481366459

#### Exercise5 위 문제를 query문으로 작성해보세요.

In [46]:
## code here

house.query('yr_built>2010 and bedrooms >= bedrooms.mean()').filter(['price']).mean()

price    742855.548137
dtype: float64

#### Exercise6 example 파일을 불러오세요.

In [ ]:
## code here